from framework.direct_graph.directGraph import DirectGraph

test_node_flow = \
    {
        '登录': {
            '登出': 1,
            '申请贷款': 10,
            '查询贷款': 2.5
        },
        '登出': {
            '登录': 1
        },
        '申请贷款': {
            '编辑':5 ,
            '提交审核': 10,
            '提交审批': 2,
            '登出': 1
        },
        '提交审核': {
            '督导审核': 10,
            '登出': 1
        },
        '督导审核': {
            '风险审批': 5,
            '主任审批': 10,
            '提交审核': 2.5,
            '登出': 1
        },
        '主任审批': {
            '合同签订': 10,
            '督导审核': 5,
            '提交审批': 2.5,
            '提交审核': 2,
            '登出': 1
        },
        '风险审批': {
            '主任审批': 10,
            '督导审核': 5,
            '登出': 1,
            '结束': 2.5
        },
        '合同签订': {
            '风险审核': 10,
            '登出': 1,
            '提交审核': 2,
        },
        '风险审核': {
            '登出': 1,
            '放款': 10,
            '合同签订': 5,
            '提交审核': 2.5
        },
        '结束': {
            '登出': 1
        }
    }

nodes = ['登出', '主任审批', '合同签订', '结束', '提交审核', '放款', '督导审核', '申请贷款', '查询贷款', '登录', '风险审核', '提交审批', '风险审批']
edges = [
    ('登录', '登出', 1),
    ('登录', '申请贷款', 8),
    ('登录', '查询贷款', 1.5),
    ('申请贷款', '提交审核', 8),
    ('申请贷款', '提交审批', 3),
    ('申请贷款', '登出', 2),
    ('登出', '登录', 1),
    ('提交审核', '督导审核', 8),
    ('提交审批', '主任审批', 2),
    ('督导审核', '风险审批', 5),
    ('督导审核', '主任审批', 8),
    ('风险审批', '主任审批', 5),
    ('主任审批', '合同签订', 8),
    ('合同签订', '风险审核', 8),
    ('风险审核', '放款', 8),
    ('放款', '结束', 5),
    ('结束', '登出', 3),
    ('督导审核', '提交审核', 2),
    ('督导审核', '结束', 0.5),
    ('风险审批', '督导审核', 1),
    ('风险审批', '结束', 2),
    ('主任审批', '督导审核', 4),
    ('主任审批', '提交审核', 2),
    ('主任审批', '提交审批', 2),
    ('合同签订', '申请贷款', 2),
    ('风险审核', '主任审批', 3),
    ('风险审核', '申请贷款', 3),
    ('风险审核', '督导审核', 3),
    ('风险审核', '结束', 2)
]


tmp2 = DirectGraph(edges=edges)
v = tmp2.get_all_path(start='登录', stop='登出')
print(len(v))
for k in v:
    print(k)
